DESENVOLVIMENTO/V2_bkp/BKP VIRADA V2 20220910_1749/soap/soap_config.php

var  = '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">'
   '<soapenv:Header/>'
   '<soapenv:Body>'
      '<tot:SaveRecord>'
         '<tot:DataServerName>'MOVMOVIMENTOTBCDATA'</tot:DataServerName>'
         '<tot:XML>''<![CDATA['<MovMovimento >'
  '<TMOV>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<CODFILIAL>1</CODFILIAL>'
    '<CODLOC>01</CODLOC>'
    '<CODLOCDESTINO>01</CODLOCDESTINO>'
    '<NUMEROMOV>-1</NUMEROMOV>'
    '<SERIE>----</SERIE>'
    '<CODTMV>1.2.04</CODTMV>'
    '<TIPO>A</TIPO>'
    '<STATUS>N</STATUS>'
    '<DATAEMISSAO>'+ 2020-10-05T00:00:00 +'</DATAEMISSAO>'       
    '<DATAMOVIMENTO>'+ 2020-10-05T00:00:00 +'</DATAMOVIMENTO>'
    '<HORULTIMAALTERACAO>'+2009-10-26T09:54:56+'</HORULTIMAALTERACAO>'    
    '<DATACRIACAO>'+2020-10-05T00:00:00+'</DATACRIACAO>'     
    '<CODCOLIGADA1>1</CODCOLIGADA1>'
    '<IDMOVHST>-1</IDMOVHST>'
  '</TMOV>'   
  '<TITMMOV>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>'+1+'</NSEQITMMOV>'
    '<CODFILIAL>1</CODFILIAL>'
    '<NUMEROSEQUENCIAL>'+1+'</NUMEROSEQUENCIAL>'
    '<IDPRD>4109</IDPRD>'
    '<CODIGOPRD>99.02.0001</CODIGOPRD>'
    '<NOMEFANTASIA>HORAS TRABALHADAS</NOMEFANTASIA>'
    '<CODIGOREDUZIDO>05133</CODIGOREDUZIDO>'
    '<NUMNOFABRIC>99.02.0001</NUMNOFABRIC>'
    '<QUANTIDADE>1</QUANTIDADE>'
    '<DATAEMISSAO>'+2020-10-05T00:00:00+'</DATAEMISSAO>'
    '<CAMPOLIVRE>'+00012458+'</CAMPOLIVRE>'
    '<CODUND>H</CODUND>'
    '<QUANTIDADEARECEBER>1</QUANTIDADEARECEBER>'
    '<QUANTIDADEORIGINAL>1</QUANTIDADEORIGINAL>'
    '<FLAG>0</FLAG>'
    '<BLOCK>0</BLOCK>'
    '<QTDEVOLUMEUNITARIO>1</QTDEVOLUMEUNITARIO>'
    '<CODLOC>01</CODLOC>'    
    '<PRECOUNITARIOSELEC>256</PRECOUNITARIOSELEC>'
    '<QUANTIDADETOTAL>1</QUANTIDADETOTAL>'
    '<PRODUTOSUBSTITUTO>0</PRODUTOSUBSTITUTO>'
    '<INTEGRAAPLICACAO>T</INTEGRAAPLICACAO>'
    '<CODCOLIGADA1>1</CODCOLIGADA1>'
    '<IDMOVHST>-1</IDMOVHST>'
    '<NSEQITMMOV1>1</NSEQITMMOV1>'
  '</TITMMOV>'
  '<TITMMOV>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>'+2+'</NSEQITMMOV>'
    '<CODFILIAL>1</CODFILIAL>'
    '<NUMEROSEQUENCIAL>'+2+'</NUMEROSEQUENCIAL>'
    '<IDPRD>4109</IDPRD>'
    '<CODIGOPRD>99.02.0001</CODIGOPRD>'
    '<NOMEFANTASIA>HORAS TRABALHADAS</NOMEFANTASIA>'
    '<CODIGOREDUZIDO>05133</CODIGOREDUZIDO>'
    '<NUMNOFABRIC>99.02.0001</NUMNOFABRIC>'
    '<QUANTIDADE>1</QUANTIDADE>'
    '<PRECOUNITARIOSELEC>256</PRECOUNITARIOSELEC>'
    '<DATAEMISSAO>'+2020-10-05T00:00:00+'</DATAEMISSAO>'
    '<CAMPOLIVRE>'+001075+'</CAMPOLIVRE>'
    '<CODUND>H</CODUND>'
    '<QUANTIDADEARECEBER>1</QUANTIDADEARECEBER>'
    '<QUANTIDADEORIGINAL>1</QUANTIDADEORIGINAL>'
    '<FLAG>0</FLAG>'
    '<BLOCK>0</BLOCK>'
    '<QTDEVOLUMEUNITARIO>1</QTDEVOLUMEUNITARIO>'
    '<CODLOC>01</CODLOC>'  
    '<QUANTIDADETOTAL>1</QUANTIDADETOTAL>'
    '<PRODUTOSUBSTITUTO>0</PRODUTOSUBSTITUTO>'
    '<INTEGRAAPLICACAO>'T'</INTEGRAAPLICACAO>'
    '<CODCOLIGADA1>1</CODCOLIGADA1>'
    '<IDMOVHST>-1</IDMOVHST>'
    '<NSEQITMMOV1>2</NSEQITMMOV1>'
  '</TITMMOV>'
  '<TITMMOV>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>'+3+'</NSEQITMMOV>'
    '<CODFILIAL>1</CODFILIAL>'
    '<NUMEROSEQUENCIAL>'+3+'</NUMEROSEQUENCIAL>'
    '<IDPRD>4109</IDPRD>'
    '<CODIGOPRD>99.02.0001</CODIGOPRD>'
    '<NOMEFANTASIA>HORAS TRABALHADAS</NOMEFANTASIA>'
    '<CODIGOREDUZIDO>05133</CODIGOREDUZIDO>'
    '<NUMNOFABRIC>99.02.0001</NUMNOFABRIC>'
    '<QUANTIDADE>1</QUANTIDADE>'
    '<PRECOUNITARIOSELEC>256</PRECOUNITARIOSELEC>'
    '<DATAEMISSAO>'+2009-10-23T00:00:00+'</DATAEMISSAO>'
    '<CAMPOLIVRE>'+00012528+'</CAMPOLIVRE>'
    '<CODUND>H</CODUND>'
    '<QUANTIDADEARECEBER>1</QUANTIDADEARECEBER>'
    '<QUANTIDADEORIGINAL>1</QUANTIDADEORIGINAL>'
    '<FLAG>0</FLAG>'
    '<BLOCK>0</BLOCK>' 
    '<QTDEVOLUMEUNITARIO>1</QTDEVOLUMEUNITARIO>'
    '<CODLOC>01</CODLOC>'
    '<QUANTIDADETOTAL>1</QUANTIDADETOTAL>'
    '<PRODUTOSUBSTITUTO>0</PRODUTOSUBSTITUTO>'
    '<INTEGRAAPLICACAO>T</INTEGRAAPLICACAO>'
    '<CODCOLIGADA1>1</CODCOLIGADA1>'
    '<IDMOVHST>-1</IDMOVHST>'
    '<NSEQITMMOV1>'+3+'</NSEQITMMOV1>'
  '</TITMMOV>'  
  '<TITMMOVCOMPL>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>1</NSEQITMMOV>'
    '<REQUISITANTE>'+000954+'</REQUISITANTE>'
    '<HORAINICIO>'+08:30+'</HORAINICIO>'
    '<HORAFINAL>'+09:30+'</HORAFINAL>'
    '<RECMODIFIEDBY>'mestre'</RECMODIFIEDBY>'
    '<RECMODIFIEDON>'+2020-10-20T13:18:28+'</RECMODIFIEDON>'
    '<NOS>'+013199+'</NOS>'    
  '</TITMMOVCOMPL>'
  '<TITMMOVCOMPL>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>'+2+'</NSEQITMMOV>'
    '<REQUISITANTE>'+000942+'</REQUISITANTE>'
    '<HORAINICIO>'+12:00+'</HORAINICIO>'
    '<HORAFINAL>'+15:00+'</HORAFINAL>'
    '<RECMODIFIEDBY>mestre</RECMODIFIEDBY>'
    '<RECMODIFIEDON>'+2020-10-20T13:18:28+'</RECMODIFIEDON>'
    '<NOS>'+013199+'</NOS>'
    '</TITMMOVCOMPL>'
  '<TITMMOVCOMPL>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<NSEQITMMOV>'+3+'</NSEQITMMOV>'
    '<REQUISITANTE>'+001018+'</REQUISITANTE>'
    '<HORAINICIO>'+15:00+'</HORAINICIO>'
    '<HORAFINAL>'+16:30+'</HORAFINAL>'
    '<RECMODIFIEDBY>mestre</RECMODIFIEDBY>'
    '<RECMODIFIEDON>'+2020-10-05T13:18:28+'</RECMODIFIEDON>'
    '<NOS>'+013199+'</NOS>'    
  '</TITMMOVCOMPL>'
  '<TMOVTRANSP>'
    '<CODCOLIGADA>1</CODCOLIGADA>'
    '<IDMOV>-1</IDMOV>'
    '<LOTACAO>1</LOTACAO>'
  '</TMOVTRANSP>'
'</MovMovimento>']]>''</tot:XML>'
         '<!--Optional:-->'
         '<tot:Contexto>'CODCOLIGADA=1;CODUSUARIO=fluig;CODSISTEMA=G'</tot:Contexto>'
      '</tot:SaveRecord>'
   '</soapenv:Body>'
'</soapenv:Envelope>'